app/controllers/category_controller.rb

  def create
      @newCategory = @currentUser.categories.new(params[:categoryform])
      if request.post?
        @newCategory.save
---
INSERT INTO `categories` (`reminder_id`, `category_title`, `updated_at`, `profile_id`, `created_at`) VALUES(NULL, 'TODO', '2010-01-13 14:11:08', NULL, '2010-01-13 14:11:08')