app/controllers/contact_controller.rb

  def show
    @currentContact = @currentUser.contacts.find(:all)
---
SELECT * FROM `contacts` WHERE (`contacts`.profile_id = 2)

  def create
    @newContact = @currentUser.contacts.new(params[:contactform])
    if request.post?
      @newContact.save
---
INSERT INTO `contacts` (`lastName`, `tagStatus`, `updated_at`, `dateOfBirth`, `group_id`, `firstName`, `mobilePhone`, `gender`, `note`, `profile_id`, `email`, `created_at`) VALUES(NULL, NULL, '2009-12-20 14:25:12', NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, '2009-12-20 14:25:12')

  def edit
     @currentContact = @currentUser.contacts.find_by_id(params[:id])
     if request.post?
       @currentContact.update_attributes(params[:contactform])
---
SELECT * FROM `contacts` WHERE (`contacts`.profile_id = 1 AND (`contacts`.`id` IS NULL)) LIMIT 1
UPDATE `contacts` SET `tagStatus` = NULL, `updated_at` = '2010-01-12 08:28:21', `lastName` = 'ABC' WHERE `id` = 3

  def delete
     @currentContact = @currentUser.contacts.find_by_id(params[:id])
     if @currentContact.tagStatus != 1
       @currentContact.destroy
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = '1') AND (`contacts`.profile_id = 1) LIMIT 1
DELETE FROM `contacts` WHERE `id` = 1