app/controllers/group_controller.rb

SELECT * FROM `groups` WHERE (`groups`.profile_id = 1)
---
  def show
    @currentGroup = @currentUser.groups.find(:all)

INSERT INTO `groups` (`tagStatus`, `updated_at`, `title`, `description`, `profile_id`, `created_at`) VALUES(NULL, '2009-12-21 14:15:04', 'Friends', 'Hello', 1, '2009-12-21 14:15:04')
---
  def create
      @newGroup = @currentUser.groups.new(params[:group])
      if request.post?
        @newGroup.save

SELECT * FROM `groups` WHERE (`groups`.`id` = '1') AND (`groups`.profile_id = 1) LIMIT 1
---
  def edit
      @currentGroup = @currentUser.groups.find_by_id(params[:id])