app/controllers/profile_controller.rb

SELECT * FROM `profiles` WHERE (`profiles`.`password` = '7c222fb2927d828af22f592134e8932480637c0d' AND `profiles`.`email` = 'yemyat@gmail.com') LIMIT 1
---
  def authenticate
    @user = Profile.new(params[:userform])
    @encryptPassword= Digest::SHA1.hexdigest(@user.password)
    auth_user = Profile.find_by_email_and_password(@user.email,@encryptPassword)

INSERT INTO `profiles` (`membership`, `lastName`, `updated_at`, `dateOfBirth`, `firstName`, `mobilePhone`, `gender`, `password`, `email`, `created_at`) VALUES('', '', '2009-12-20 14:07:47', NULL, '', '', 0, '7c7a2726283134b2ec0c9393b78d10a86a475003', 'yemyat@gmail.com', '2009-12-20 14:07:47')
---
  def doregister
    @newUser = Profile.new(params[:userform])
    @encryptPassword = Digest::SHA1.hexdigest(@newUser.password)
    @registerUser = Profile.create(:password => @encryptPassword, :firstName => @newUser.firstName, :lastName => @newUser.lastName, :mobilePhone => @newUser.mobilePhone, :email =>@newUser.email, :gender => @newUser.gender,:dateOfBirth =>@newUser.dateOfBirth, :membership =>@newUser.membership  )