app/controllers/reminder_controller.rb

  def create
    @newReminder = @currentUser.reminders.new(params[:reminderform])

    if request.post?
      @newReminder.save
      unless params[:crecipient][:crecipient] == [""]
        addContact(params[:crecipient]['crecipient'],@newReminder)
      end
      unless params[:grecipient][:grecipient]==[""]
        addGroup(params[:grecipient][:grecipient],@newReminder)
      end
      if params[:reminder][:frequency] == '1'
        @newReminder.monthlies.create(:delivery_date => params[:reminderform]['reminderDate'])
      elsif params[:reminder][:frequency] =='2'
         @newReminder.yearlies.create(:delivery_date => params[:reminderform]['reminderDate'])
      elsif params[:reminder][:frequency] =='3'
         @newReminder.onetimes.create(:delivery_date => params[:reminderform]['reminderDate'])
---
INSERT INTO `reminders` (`updated_at`, `reminderMessage`, `reminderDate`, `reminderTitle`, `profile_id`, `created_at`) VALUES('2010-01-10 07:10:57', 'this is without contact or groups\r\n', NULL, 'without contacts', 1, '2010-01-10 07:10:57')
INSERT INTO `yearlies` (`reminder_id`, `updated_at`, `delivery_date`, `created_at`) VALUES(9, '2010-01-19 15:51:31', NULL, '2010-01-19 15:51:31')
INSERT INTO `onetimes` (`reminder_id`, `updated_at`, `delivery_date`, `created_at`) VALUES(7, '2010-01-19 15:47:51', NULL, '2010-01-19 15:47:51')

  def show
    @currentReminder = @currentUser.reminders.find(:all)
---
SELECT * FROM `reminders` WHERE (`reminders`.profile_id = 1)

  def edit
    @currentReminder = @currentUser.reminders.find_by_id(params[:id])
    if request.post?
      @currentReminder.update_attributes(params[:reminderform])
---
SELECT * FROM `reminders` WHERE (`reminders`.`id` IS NULL) AND (`reminders`.profile_id = 1) LIMIT 1
UPDATE `reminders` SET `reminderMessage` = 'this is without contact or groups', `updated_at` = '2010-01-10 07:20:25' WHERE `id` = 2

  def delete
    @currentUser.reminders.destroy(params[:id])
---
DELETE FROM `reminders` WHERE `id` = 3

  def showTaggedContacts
    @taggedContacts = []
    reminderContact = Tagcontact.find(:all, :conditions=>{:profile_id => @currentUser.id,:reminder_id => params[:id]})
    reminderContact.each do |a|
      myContact = @currentUser.contacts.find_by_id(a.contact_id)
      @taggedContacts.push(myContact.firstName + ' ' + myContact.lastName)
    end
    @reminderGroup = Taggroup.find(:all, :conditions=>{:profile_id => @currentUser.id, :reminder_id => params[:id]})
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1) AND (`contacts`.profile_id = 1) LIMIT 1
SELECT * FROM `tagcontacts` WHERE (`tagcontacts`.`reminder_id` = '1' AND `tagcontacts`.`profile_id` = 1)
SELECT * FROM `contacts` WHERE (`contacts`.`group_id` = 1) AND (`contacts`.profile_id = 1) LIMIT 1
SELECT * FROM `taggroups` WHERE (`taggroups`.`profile_id` = 1 AND `taggroups`.`reminder_id` = '4')